<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>分享一個月內使用新技術完成作品-火箭隊培訓營 - Hexo</title>

<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="我是穎旻，目前是快要大學畢業的學生，正在學習前端的漫漫長途中，你好你好！這是我的第一篇文章，我想分享自己待在高雄的工程師培訓營中經歷一個半月專案的實作過程。">



<meta name="keywords" content="前端,網頁,技術,網頁開發,前端開發,JavaScript,HTML,CSS,SCSS">



    <meta name="description" content="我是穎旻，目前是快要大學畢業的學生，正在學習前端的漫漫長途中，你好你好！這是我的第一篇文章，我想分享自己待在高雄的工程師培訓營中經歷一個半月專案的實作過程。">
<meta property="og:type" content="article">
<meta property="og:title" content="分享一個月內使用新技術完成作品-火箭隊培訓營">
<meta property="og:url" content="http://yinmin8610.github.io/share/20200403/1243066710/index.html">
<meta property="og:site_name" content="Hexo">
<meta property="og:description" content="我是穎旻，目前是快要大學畢業的學生，正在學習前端的漫漫長途中，你好你好！這是我的第一篇文章，我想分享自己待在高雄的工程師培訓營中經歷一個半月專案的實作過程。">
<meta property="og:locale" content="zh_TW">
<meta property="article:published_time" content="2020-04-03T04:33:01.000Z">
<meta property="article:modified_time" content="2020-05-27T07:34:09.284Z">
<meta property="article:author" content="yinmin8610">
<meta property="article:tag" content="六角學院">
<meta property="article:tag" content="前端">
<meta property="article:tag" content="火箭隊培訓營">
<meta name="twitter:card" content="summary">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.9.0/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    
<script async src="https://www.googletagmanager.com/gtag/js?id=UA-154219631-1"></script>
<script>
    window.dataLayer = window.dataLayer || [];
    function gtag(){dataLayer.push(arguments);}
    gtag('js', new Date());

    gtag('config', 'UA-154219631-1');
</script>


    


<!-- Global site tag (gtag.js) - Google Analytics -->
<script async src="https://www.googletagmanager.com/gtag/js?id=UA-154219631-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-154219631-1');
</script>

<meta name="generator" content="Hexo 4.2.1"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">文章</a>
            
            <a class="navbar-item "
               href="/categories">分類</a>
            
            <a class="navbar-item "
               href="/tags">標籤</a>
            
            <a class="navbar-item "
               href="/about">關於我</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜尋" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            <div class="navbar-item is-hoverable has-dropdown is-hidden-mobile is-hidden-tablet-only toc">
                <a class="navbar-item" title="目錄">
                    <i class="fa fa-list"></i>
                </a>
                <div class="navbar-dropdown is-right">
                    
                    
                    
                    
                    <a class="navbar-item" href="#前言">1&nbsp;&nbsp;<b>前言</b></a>
                    
                    
                    
                    <a class="navbar-item" href="#火箭隊培訓營">1.1&nbsp;&nbsp;火箭隊培訓營</a>
                    
                    
                    
                    <a class="navbar-item" href="#報名資訊">1.2&nbsp;&nbsp;報名資訊</a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#我在火箭隊的生活">2&nbsp;&nbsp;<b>我在火箭隊的生活</b></a>
                    
                    
                    
                    <a class="navbar-item" href="#時程規劃">2.1&nbsp;&nbsp;時程規劃</a>
                    
                    
                    
                    <a class="navbar-item" href="#新技術的學習方法">2.2&nbsp;&nbsp;新技術的學習方法</a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#總結">3&nbsp;&nbsp;<b>總結</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#第二梯其他學員的文章參考">4&nbsp;&nbsp;<b>第二梯其他學員的文章參考</b></a>
                    
                </div>
            </div>
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/yinmin8610" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            <a class="navbar-item" title="Medium" href="https://medium.com/@alice0050722" target="_blank" rel="noopener">
                
                <i class="fab fa-medium"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            分享一個月內使用新技術完成作品-火箭隊培訓營
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2020-04-03T04:33:01.000Z" itemprop="datePublished">4月 3 2020</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/share/">分享</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            15 分钟 讀完 (約 2210 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x6211;&#x662F;&#x7A4E;&#x65FB;&#xFF0C;&#x76EE;&#x524D;&#x662F;&#x5FEB;&#x8981;&#x5927;&#x5B78;&#x7562;&#x696D;&#x7684;&#x5B78;&#x751F;&#xFF0C;&#x6B63;&#x5728;&#x5B78;&#x7FD2;&#x524D;&#x7AEF;&#x7684;&#x6F2B;&#x6F2B;&#x9577;&#x9014;&#x4E2D;&#xFF0C;&#x4F60;&#x597D;&#x4F60;&#x597D;&#xFF01;<br>&#x9019;&#x662F;&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6211;&#x60F3;&#x5206;&#x4EAB;&#x81EA;&#x5DF1;&#x5F85;&#x5728;&#x9AD8;&#x96C4;&#x7684;&#x5DE5;&#x7A0B;&#x5E2B;&#x57F9;&#x8A13;&#x71DF;&#x4E2D;&#x7D93;&#x6B77;&#x4E00;&#x500B;&#x534A;&#x6708;&#x5C08;&#x6848;&#x7684;&#x5BE6;&#x4F5C;&#x904E;&#x7A0B;&#x3002;</p>
<a id="more"></a>

<h2 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h2><h3 id="&#x706B;&#x7BAD;&#x968A;&#x57F9;&#x8A13;&#x71DF;"><a href="#&#x706B;&#x7BAD;&#x968A;&#x57F9;&#x8A13;&#x71DF;" class="headerlink" title="&#x706B;&#x7BAD;&#x968A;&#x57F9;&#x8A13;&#x71DF;"></a>&#x706B;&#x7BAD;&#x968A;&#x57F9;&#x8A13;&#x71DF;</h3><p>&#x300C;&#x706B;&#x7BAD;&#x968A;&#x57F9;&#x8A13;&#x71DF;&#x300D;&#x662F;&#x7531; &#x5ED6;&#x6D27;&#x6770; &#x548C; Justin &#x5169;&#x4F4D;&#x8001;&#x5E2B;&#x5728;&#x9AD8;&#x96C4;&#x5275;&#x8FA6;&#x7684;&#x7DDA;&#x4E0B;&#x5BE6;&#x9AD4;&#x5DE5;&#x7A0B;&#x5E2B;&#x57F9;&#x8A13;&#x71DF;&#xFF0C;&#x4E3B;&#x8981;&#x57F9;&#x80B2;&#x524D;&#x5F8C;&#x7AEF;&#x4EBA;&#x624D;&#xFF0C;&#x904E;&#x7A0B;&#x5168;&#x7A0B;&#x514D;&#x8CBB;&#x3002;&#x7576;&#x521D;&#x77E5;&#x9053;&#x6709;&#x9019;&#x500B;&#x57F9;&#x8A13;&#x71DF;&#x6642;&#x89BA;&#x5F97;&#x8001;&#x5E2B;&#x592A;&#x4F5B;&#x5FC3;&#x4E86;&#xFF01; &#x5F8C;&#x4F86;&#x624D;&#x77E5;&#x9053;&#x539F;&#x4F86;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x4E5F;&#x6709;&#x4EBA;&#x5728;&#x505A;&#x985E;&#x4F3C;&#x7684;&#x4E8B;&#xFF0C;&#x50CF;&#x662F;&#x5728;&#x53F0;&#x5357;&#x7684;&#x597D;&#x60F3;&#x5DE5;&#x4F5C;&#x5BA4;&#x3001;&#x53F0;&#x5317;&#x7684; AppWorks School &#x548C; CMoney&#x3002;&#x53EA;&#x662F;&#x6BCF;&#x500B;&#x57F9;&#x8A13;&#x71DF;&#x6700;&#x7D42;&#x7684;&#x76EE;&#x7684;&#x4E0D;&#x4E00;&#x5B9A;&#x76F8;&#x540C;&#xFF0C;&#x706B;&#x7BAD;&#x968A;&#x6700;&#x7D42;&#x662F;&#x5E0C;&#x671B;&#x80FD;&#x5354;&#x52A9;&#x8F49;&#x8077;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6311;&#x9078;&#x4EBA;&#x548C;&#x898F;&#x5283;&#x5B78;&#x54E1;&#x7684;&#x5B78;&#x7FD2;&#x8DEF;&#x7DDA;&#x6642;&#x5C31;&#x6703;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x706B;&#x7BAD;&#x968A;&#x6B63;&#x5728;&#x62DB;&#x52DF;&#x7B2C;&#x4E94;&#x3001;&#x516D;&#x68AF;&#x6210;&#x54E1;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8208;&#x8DA3;&#x7684;&#x4EBA;&#x5011;&#x53EF;&#x4EE5;&#x53C3;&#x8003;&#x4E0B;&#x9762;&#x7684;&#x8CC7;&#x8A0A;&#xFF0C;&#x932F;&#x904E;&#x7684;&#x8A71;&#x4E5F;&#x53EF;&#x4EE5;&#x5148; follow FB &#x7C89;&#x5C08; &#xFF0C;&#x6700;&#x65B0;&#x8CC7;&#x8A0A;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x9019;&#x88E1;&#x770B;&#x5230;&#x3002;</p>
<h3 id="&#x5831;&#x540D;&#x8CC7;&#x8A0A;"><a href="#&#x5831;&#x540D;&#x8CC7;&#x8A0A;" class="headerlink" title="&#x5831;&#x540D;&#x8CC7;&#x8A0A;"></a>&#x5831;&#x540D;&#x8CC7;&#x8A0A;</h3><p>&#x5831;&#x540D;&#x6642;&#x9593;&#xFF1A;4/6&#xFF5E;4/19 <a href="https://rocketcamp.kktix.cc/events/747c7c9a-copy-2" target="_blank" rel="noopener">&#x8A73;&#x7D30;&#x8CC7;&#x8A0A;</a></p>
<h2 id="&#x6211;&#x5728;&#x706B;&#x7BAD;&#x968A;&#x7684;&#x751F;&#x6D3B;"><a href="#&#x6211;&#x5728;&#x706B;&#x7BAD;&#x968A;&#x7684;&#x751F;&#x6D3B;" class="headerlink" title="&#x6211;&#x5728;&#x706B;&#x7BAD;&#x968A;&#x7684;&#x751F;&#x6D3B;"></a>&#x6211;&#x5728;&#x706B;&#x7BAD;&#x968A;&#x7684;&#x751F;&#x6D3B;</h2><p>&#x901A;&#x5E38;&#x5B78;&#x54E1;&#x6703;&#x99D0;&#x9EDE;&#x5B78;&#x7FD2;&#x81F3;&#x5C11;&#x534A;&#x5E74;&#xFF0C;&#x6700;&#x7D42;&#x6703;&#x7522;&#x51FA;&#x4E00;&#x500B;&#x9762;&#x8A66;&#x4F5C;&#x54C1;&#x3002;&#x4F46;&#x6211;&#x56E0;&#x70BA;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#x6240;&#x4EE5;&#x5728;&#x6700;&#x5F8C;&#x4E00;&#x500B;&#x6708;&#x624D;&#x52A0;&#x5165;&#xFF0C;&#x6C92;&#x6709;&#x53C3;&#x8207;&#x5230;&#x524D;&#x534A;&#x90E8;&#x9762;&#x8A66;&#x548C;&#x5B78;&#x7FD2;&#x7684;&#x904E;&#x7A0B;&#xFF0C;&#x53EA;&#x6709;&#x5B8C;&#x6210;&#x6700;&#x7D42;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x6240;&#x4EE5;&#x82E5;&#x60F3;&#x77E5;&#x9053;&#x9762;&#x8A66;&#x548C;&#x5B78;&#x7FD2;&#x904E;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x53C3;&#x8003;&#x7B2C;&#x4E00;&#x68AF;&#x5B78;&#x54E1;&#xFF0C;<a href="https://medium.com/@sun8chi/%E5%85%AD%E8%A7%92%E5%AD%B8%E9%99%A2-%E7%81%AB%E7%AE%AD%E9%9A%8A%E8%BB%9F%E9%AB%94%E5%B7%A5%E7%A8%8B%E5%B8%AB%E5%9F%B9%E8%A8%93%E7%87%9F-8cf2c03549dc?source=search_post---------0" target="_blank" rel="noopener">&#x5B9C;&#x84C1;</a>&#x7684;&#x6587;&#x7AE0;&#x3002;</p>
<blockquote>
<p>&#x6B64;&#x7BC7;&#x4E3B;&#x8981;&#x8457;&#x91CD;&#x5728;&#x4F5C;&#x54C1;&#x7684;&#x7522;&#x751F;&#x904E;&#x7A0B;&#x4EE5;&#x53CA;&#x4E00;&#x500B;&#x6708;&#x5167;&#x5B78;&#x7FD2;&#x4E00;&#x9805;&#x65B0;&#x6280;&#x8853;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
<p>&#x4F5C;&#x54C1;&#x6703;&#x8B93;&#x524D;&#x7AEF;&#x8207;&#x5F8C;&#x7AEF;&#x642D;&#x914D;&#x4E00;&#x8D77;&#x5B8C;&#x6210;&#xFF0C;&#x4F46;&#x56E0;&#x70BA;&#x6211;&#x6700;&#x6162;&#x9032;&#x4F86;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x5DF2;&#x7D93;&#x6709;&#x5404;&#x81EA;&#x7684;&#x5925;&#x4F34;&#x4E86;&#xFF0C;&#x65BC;&#x662F;&#x6211;&#x53EA;&#x597D;&#x81EA;&#x5DF1;&#x5B8C;&#x6210;&#x6211;&#x7684;&#xFF08;&#x54ED;&#xFF09;&#x3002; &#x4E5F;&#x56E0;&#x70BA;&#x6211;&#x6C92;&#x6709;&#x5F8C;&#x7AEF;&#xFF0C;&#x6D27;&#x6770;&#x8001;&#x5E2B;&#x5EFA;&#x8B70;&#x6211;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Json server &#x4F86;&#x5FEB;&#x901F;&#x5EFA;&#x7ACB;&#x7C21;&#x55AE;&#x7684; Rest API&#x3002;</p>
<p>&#x4E00;&#x958B;&#x59CB;&#x60F3;&#x984C;&#x76EE;&#x6642;&#xFF0C;&#x6211;&#x5F9E;&#x81EA;&#x5DF1;&#x751F;&#x6D3B;&#x4E0A;&#x7684;&#x7D93;&#x9A57;&#x53BB;&#x5C0B;&#x627E;&#x9748;&#x611F;&#xFF0C;&#x4E00;&#x5171;&#x60F3;&#x4E86;&#x4E94;&#x500B;&#x3002;&#x8207;&#x8001;&#x5E2B;&#x8A0E;&#x8AD6;&#x904E;&#x5F8C;&#xFF0C;&#x89BA;&#x5F97;&#x81EA;&#x5DF1;&#x5C0D;&#x7B2C;&#x4E00;&#x500B;&#x6BD4;&#x8F03;&#x6709;&#x5171;&#x9CF4;&#x548C;&#x60F3;&#x6CD5;&#xFF0C;&#x4E3B;&#x984C;&#x662F;&#x7DDA;&#x4E0A;&#x79DF;&#x5C4B;&#xFF0C;&#x65BC;&#x662F; Homie &#x5C31;&#x9019;&#x6A23;&#x8A95;&#x751F;&#x5566;&#xFF5E;&#xFF5E;&#xFF01;</p>
<h3 id="&#x6642;&#x7A0B;&#x898F;&#x5283;"><a href="#&#x6642;&#x7A0B;&#x898F;&#x5283;" class="headerlink" title="&#x6642;&#x7A0B;&#x898F;&#x5283;"></a>&#x6642;&#x7A0B;&#x898F;&#x5283;</h3><p>&#x5728;&#x6642;&#x7A0B;&#x65B9;&#x9762;&#xFF0C;&#x9032;&#x4F86;&#x7684;&#x6642;&#x9593;&#x662F;2/10&#xFF0C;&#x5F97;&#x77E5; 3/27 &#x5C31;&#x8981;&#x767C;&#x8868;&#x4F5C;&#x54C1;&#xFF0C;&#x5927;&#x7D04;&#x6709;&#x4E00;&#x500B;&#x534A;&#x6708;&#x7684;&#x6642;&#x9593;&#x3002;&#x6211;&#x82B1;&#x4E86;&#x5C07;&#x8FD1;&#x5169;&#x9031;&#x5B78;&#x7FD2; Vue&#xFF0C;&#x4E00;&#x9031;&#x505A;&#x5C0F;&#x7DF4;&#x7FD2;&#x3002;&#x5269;&#x4E0B;&#x7684;&#x6642;&#x9593;&#x5207;&#x5206;&#x70BA;&#x4E09;&#x500B;&#x968E;&#x6BB5;&#xFF0C;&#x4E2D;&#x5F8C;&#x671F;&#x8457;&#x91CD;&#x5728;&#x958B;&#x767C;&#x5E73;&#x53F0;&#x4E0A;&#x3002;</p>
<h3 id="&#x65B0;&#x6280;&#x8853;&#x7684;&#x5B78;&#x7FD2;&#x65B9;&#x6CD5;"><a href="#&#x65B0;&#x6280;&#x8853;&#x7684;&#x5B78;&#x7FD2;&#x65B9;&#x6CD5;" class="headerlink" title="&#x65B0;&#x6280;&#x8853;&#x7684;&#x5B78;&#x7FD2;&#x65B9;&#x6CD5;"></a>&#x65B0;&#x6280;&#x8853;&#x7684;&#x5B78;&#x7FD2;&#x65B9;&#x6CD5;</h3><p>&#x5728;&#x8B1B;&#x5B78;&#x7FD2;&#x4E00;&#x9805;&#x65B0;&#x6280;&#x8853;&#x524D;&#xFF0C;&#x5148;&#x8AAA;&#x660E;&#x4E00;&#x4E0B;&#x9019;&#x6B21;&#x5C08;&#x6848;&#x4F7F;&#x7528;&#x7684;&#x6280;&#x8853;&#x662F;&#x524D;&#x7AEF;&#x6846;&#x67B6; Vue&#x3002;&#x6211;&#x5728;&#x4F86;&#x706B;&#x7BAD;&#x968A;&#x4E4B;&#x524D;&#x5DF2;&#x7D93;&#x78B0;&#x904E;&#x5927;&#x7D04;&#x534A;&#x5E74;&#x7684; React&#xFF0C;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x958B;&#x767C;&#x7D93;&#x9A57;&#xFF08;&#x4E4B;&#x5F8C;&#x53EF;&#x4EE5;&#x5206;&#x4EAB;&#x5169;&#x8005;&#x7684;&#x5DEE;&#x5225;&#xFF0C;&#x88AB;&#x554F;&#x5230;&#x721B;&#x4E86;&#xFF5E;&#xFF5E;&#xFF5E;&#xFF09;&#xFF0C;&#x4F46;&#x6211;&#x5728;&#x5B78;&#x7FD2;&#x7684;&#x904E;&#x7A0B;&#x4E2D;&#x89BA;&#x5F97;&#x5F88;&#x632B;&#x6298;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x70BA;&#x5C0D; Javascript &#x7684;&#x8A8D;&#x8B58;&#x4E0D;&#x5920;&#x6DF1;&#xFF0C;&#x65BC;&#x662F;&#x5B78;&#x7FD2;&#x5230;&#x4E00;&#x534A;&#x53C8;&#x91CD;&#x65B0;&#x770B;&#x4E86;&#x516D;&#x89D2;&#x5B78;&#x9662;&#x7684; Javascript &#x8AB2;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#x9019;&#x6B21;&#x5728;&#x5B78;&#x7FD2; Vue &#x6642;&#x6211;&#x5C31;&#x66F4;&#x91CD;&#x8996;&#x81EA;&#x5DF1;&#x5B78;&#x7FD2;&#x7684;&#x6548;&#x679C;&#x3002;&#x5728;&#x6D27;&#x6770;&#x8001;&#x5E2B;&#x7684;<a href="https://medium.com/@gonsakon/%E6%88%91%E5%9C%A8%E7%81%AB%E7%AE%AD%E9%9A%8A%E5%AD%B8%E5%88%B0%E7%AA%81%E7%A0%B4%E7%A8%8B%E5%BC%8F%E9%82%8F%E8%BC%AF%E7%9A%84%E5%9B%9B%E7%A8%AE%E6%96%B9%E6%B3%95-2ba6a8497809" target="_blank" rel="noopener">&#x6211;&#x5728;&#x706B;&#x7BAD;&#x968A;&#x5B78;&#x5230;&#x7A81;&#x7834;&#x7A0B;&#x5F0F;&#x908F;&#x8F2F;&#x7684;&#x56DB;&#x7A2E;&#x65B9;&#x6CD5;</a>&#xFF08;&#x9019;&#x7BC7;&#x5F88;&#x503C;&#x5F97;&#x95B1;&#x8B80;&#xFF09;&#x7684;&#x6587;&#x4E2D;&#x6709;&#x63D0;&#x5230;&#xFF0C;&#x63A2;&#x7D22;&#x9069;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x5B78;&#x7FD2;&#x5438;&#x6536;&#x65B9;&#x5F0F;&#xFF0C;&#x6C92;&#x8FA6;&#x6CD5;&#x53EA;&#x900F;&#x904E;&#x4E00;&#x500B;&#x6559;&#x6750;&#x5C31;&#x80FD;&#x5920;&#x89E3;&#x6C7A;&#x5B78;&#x54E1;&#x5168;&#x90E8;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x8907;&#x5408;&#x5F0F;&#x7684;&#x5B78;&#x7FD2;&#x65B9;&#x5F0F;&#x624D;&#x80FD;&#x6839;&#x64DA;&#x6BCF;&#x500B;&#x4EBA;&#x7684;&#x80FD;&#x529B;&#x53BB;&#x6709;&#x6548;&#x5438;&#x6536;&#x5167;&#x5BB9;&#x3002;</p>
<blockquote>
<p>&#x4E3B;&#x8981;&#x7684;&#x5B78;&#x7FD2;&#x8CC7;&#x6E90;&#xFF0B;&#x7B2C;&#x4E8C;&#x500B;&#x8F14;&#x52A9;&#x5B78;&#x7FD2;&#x7684;&#x8CC7;&#x6E90;&#xFF0B;&#x5BE6;&#x4F5C;</p>
</blockquote>
<p>&#x65BC;&#x662F;&#x6839;&#x64DA;&#x4E0A;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4E5F;&#x627E;&#x51FA;&#x9069;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x5B78;&#x7FD2;&#x6A21;&#x5F0F;&#x3002;&#x5DF2;&#x7D93;&#x7FD2;&#x6163;&#x770B;&#x7DDA;&#x4E0A;&#x8AB2;&#x7A0B;&#x81EA;&#x5B78;&#x7684;&#x6211;&#xFF0C;&#x9078;&#x64C7;&#x770B;&#x516D;&#x89D2;&#x7684; Vue &#x8AB2;&#x7A0B;&#x4F86;&#x7576;&#x4F5C;&#x6211;&#x4E3B;&#x8981;&#x5B78;&#x7FD2;&#x7684;&#x8CC7;&#x6E90;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x908A;&#x505A;&#x7B46;&#x8A18;&#xFF0C;&#x5728;&#x4E0D;&#x61C2;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x6703;&#x642D;&#x914D;&#x4E00;&#x4E9B;&#x76F8;&#x95DC;&#x4E3B;&#x984C;&#x7684;&#x6280;&#x8853;&#x6587;&#x7AE0;&#xFF08;&#x8F14;&#x52A9;&#x5B78;&#x7FD2;&#xFF09;&#xFF0C;&#x6709;&#x6642;&#x5019;&#x9084;&#x80FD;&#x5F9E;&#x5225;&#x4EBA;&#x7684;&#x6587;&#x7AE0;&#x5167;&#x5B78;&#x5230;&#x66F4;&#x591A;&#x5462;&#xFF01;&#x50CF;&#x6211;&#x5728;&#x770B;&#x5230; Component &#x5143;&#x4EF6;&#x7684;&#x7AE0;&#x7BC0;&#x6642;&#x5C31;&#x5361;&#x4E86;&#x4E00;&#x6BB5;&#x6642;&#x9593;&#xFF0C;&#x89BA;&#x5F97;&#x61C2;&#x4E86;&#x4F46;&#x53C8;&#x5E38;&#x5E38;&#x5728;&#x770B;&#x8001;&#x5E2B;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x6642;&#x5931;&#x53BB;&#x65B9;&#x5411;&#xFF0C;&#x5F8C;&#x4F86;&#x53C3;&#x8003;&#x4E86;&#x5225;&#x4EBA;&#x5728; iT &#x90A6;&#x5E6B;&#x5FD9;&#x9435;&#x4EBA;&#x8CFD;&#x5206;&#x4EAB;&#x7684;&#x6587;&#x7AE0;&#x624D;&#x53C8;&#x66F4;&#x4E86;&#x89E3; Vue &#x4E2D;&#x5143;&#x4EF6;&#x50B3;&#x905E;&#x7684;&#x539F;&#x7406;&#xFF0C;&#x6700;&#x5F8C;&#x900F;&#x904E;&#x5BE6;&#x4F5C; todolist &#x7684;&#x65B9;&#x5F0F;&#x9A57;&#x8B49;&#x81EA;&#x5DF1;&#x662F;&#x5426;&#x771F;&#x7684;&#x5B78;&#x6703;&#x3002;&#x6216;&#x8A31;&#x7528;&#x9019;&#x6A23;&#x7684;&#x65B9;&#x6CD5;&#x6703;&#x8B93;&#x5B78;&#x7FD2;&#x904E;&#x7A0B;&#x5F88;&#x6F2B;&#x9577;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x771F;&#x7684;&#x5B78;&#x6703;&#x4E0D;&#x80FD;&#x53EA;&#x662F;&#x300C;&#x5927;&#x7565;&#x61C2;&#x300D;&#xFF0C;&#x4E0D;&#x7136;&#x5C31;&#x6703;&#x906D;&#x9047;&#x50CF;&#x6211;&#x524D;&#x9762;&#x7684;&#x6158;&#x75DB;&#x7D93;&#x9A57;&#x3002;&#x6216;&#x8A31;&#x6703;&#x6709;&#x4EBA;&#x60F3;&#x77E5;&#x9053;&#x8981;&#x5982;&#x4F55;&#x78BA;&#x5B9A;&#x81EA;&#x5DF1;&#x90FD;&#x5B78;&#x6703;&#x4E86;&#xFF1F;&#x7B54;&#x6848;&#x771F;&#x7684;&#x5C31;&#x662F;&#x900F;&#x904E;&#x5BE6;&#x4F5C;&#x3002;</p>
<p>&#x5BE6;&#x4F5C;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x5B78;&#x7FD2;&#x548C;&#x7406;&#x89E3;&#x7684;&#x5167;&#x5BB9;&#x662F;&#x5426;&#x6709;&#x88AB;&#x6B63;&#x78BA;&#x61C9;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5728;&#x5BE6;&#x4F5C;&#x904E;&#x7A0B;&#x4E2D;&#x767C;&#x73FE;&#x9084;&#x662F;&#x5F88;&#x5361;&#x7684;&#x8A71;&#xFF0C;&#x627E;&#x51FA;&#x5361;&#x4F4F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x518D;&#x91DD;&#x5C0D;&#x90A3;&#x90E8;&#x5206;&#x52A0;&#x5F37;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;:D</p>
<p>&#x5728;&#x6642;&#x7A0B;&#x4E0A;&#x6709;&#x9650;&#x5236;&#x6642;&#xFF0C;&#x6211;&#x6703;&#x8A02;&#x5B9A;&#x81EA;&#x5DF1;&#x6BCF;&#x9031;&#x7684;&#x5B78;&#x7FD2;&#x76EE;&#x6A19;&#xFF0C;&#x900F;&#x904E;&#x4EFB;&#x4F55;&#x53EF;&#x4EE5;&#x8A18;&#x9304;&#x7684;&#x8EDF;&#x9AD4;&#x90FD;&#x53EF;&#x4EE5;&#xFF0C;&#x9019;&#x90E8;&#x5206;&#x4E4B;&#x524D;&#x5617;&#x8A66;&#x4E86;&#x5F88;&#x4E45;&#x624D;&#x627E;&#x5230;&#x6700;&#x9069;&#x5408;&#x81EA;&#x5DF1;&#x8A02;&#x5B9A;&#x76EE;&#x6A19;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x76F4;&#x63A5;&#x8AAA;&#x91CD;&#x9EDE;&#x5C31;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x76EE;&#x6A19;&#x4E0D;&#x8981;&#x4E00;&#x4E0B;&#x8A02;&#x5F97;&#x592A;&#x5927;&#x3001;&#x8D8A;&#x7D30;&#x7BC0;&#x8D8A;&#x597D;</li>
<li>&#x6BCF;&#x5929;&#x90FD;&#x56DE;&#x5831;&#x81EA;&#x5DF1;&#x7684;&#x9032;&#x5EA6;&#x4F86;&#x770B;&#x80FD;&#x5426;&#x7B26;&#x5408;&#x9019;&#x9031;&#x7684;&#x6700;&#x7D42;&#x76EE;&#x6A19;&#xFF0C;&#x82E5;&#x6C92;&#x8FA6;&#x6CD5;&#x7684;&#x8A71;&#x8A72;&#x600E;&#x9EBC;&#x505A;&#x8ABF;&#x6574;</li>
</ul>
<p>&#x990A;&#x6210;&#x7FD2;&#x6163;&#x5F8C;&#x5C31;&#x6210;&#x4E86;&#x6211;&#x6BCF;&#x5929;&#x7761;&#x524D;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x3002;</p>
<p>&#x5B78;&#x7FD2;&#x65B0;&#x6280;&#x8853;&#x662F;&#x5F88;&#x8271;&#x8F9B;&#x7684;&#x904E;&#x7A0B;&#xFF0C;&#x4E0D;&#x65B7;&#x5728;&#x300C;&#x78B0;&#x58C1;&#x300D;&#x548C;&#x300C;&#x4E86;&#x89E3;&#x300D;&#x4E2D;&#x5FAA;&#x74B0;&#xFF0C;&#x4F46;&#x662F;&#x7576;&#x4F60;&#x6709;&#x76F8;&#x5C0D;&#x7684;&#x4F5C;&#x54C1;&#x7522;&#x51FA;&#x6642;&#xFF0C;&#x5C31;&#x6703;&#x89BA;&#x5F97;&#x4E00;&#x5207;&#x5F88;&#x503C;&#x5F97;&#xFF0C;&#x56E0;&#x70BA;&#x505A;&#x51FA;&#x4F86;&#x7684;&#x6771;&#x897F;&#x662F;&#x81EA;&#x5DF1;&#x8F9B;&#x82E6;&#x7684;&#x7D50;&#x6676;&#xFF0C;&#x4E26;&#x4E14;&#x4E5F;&#x80FD;&#x589E;&#x52A0;&#x81EA;&#x5DF1;&#x7684;&#x4FE1;&#x5FC3;&#x53BB;&#x9762;&#x5C0D;&#x66F4;&#x96E3;&#x7684;&#x6311;&#x6230;&#xFF0C;&#x7E3D;&#x4E4B;&#x9019;&#x6B21;&#x5617;&#x8A66;&#x7684;&#x5B78;&#x7FD2;&#x65B9;&#x5F0F;&#xFF0C;&#x6548;&#x679C;&#x9084;&#x4E0D;&#x932F;&#xFF5E;</p>
<h2 id="&#x7E3D;&#x7D50;"><a href="#&#x7E3D;&#x7D50;" class="headerlink" title="&#x7E3D;&#x7D50;"></a>&#x7E3D;&#x7D50;</h2><p>&#x77ED;&#x77ED;&#x4E00;&#x500B;&#x534A;&#x6708;&#x5B78;&#x4E86;&#x5F88;&#x591A;&#x65B0;&#x6771;&#x897F;&#xFF0C;&#x4E00;&#x958B;&#x59CB;&#x6709;&#x4E9B;&#x7121;&#x6CD5;&#x8CA0;&#x8377;&#xFF0C;&#x4F46;&#x73FE;&#x5728;&#x6176;&#x5E78;&#x6709;&#x9019;&#x4E9B;&#x58D3;&#x529B;&#x53EF;&#x4EE5;&#x903C;&#x8FEB;&#x81EA;&#x5DF1;&#x4E0D;&#x65B7;&#x5B78;&#x7FD2;&#x3002;&#x5728;&#x706B;&#x7BAD;&#x968A;&#xFF0C;&#x5F88;&#x559C;&#x6B61;&#x7684;&#x662F;&#x5927;&#x5BB6;&#x6703;&#x4E92;&#x76F8;&#x8A0E;&#x8AD6;&#x554F;&#x984C;&#xFF0C;&#x4E00;&#x500B;&#x4EBA;&#x81EA;&#x5B78;&#x548C;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x5B78;&#x7684;&#x611F;&#x89BA;&#x5F88;&#x4E0D;&#x4E00;&#x6A23;&#xFF0C;&#x56E0;&#x70BA;&#x77E5;&#x9053;&#x5F7C;&#x6B64;&#x90FD;&#x5728;&#x76F8;&#x540C;&#x7684;&#x9053;&#x8DEF;&#x4E0A;&#xFF0C;&#x6709;&#x554F;&#x984C;&#x90FD;&#x80FD;&#x5920;&#x4E92;&#x76F8;&#x5E6B;&#x5FD9;&#x4E92;&#x76F8;&#x52A0;&#x6CB9;&#xFF0C;&#x6240;&#x4EE5;&#x66F4;&#x6709;&#x5805;&#x6301;&#x4E0B;&#x53BB;&#x7684;&#x52D5;&#x529B;&#x3002;&#x606D;&#x559C;&#x5927;&#x5BB6;&#x6700;&#x5F8C;&#x90FD;&#x9806;&#x5229;&#x7684;&#x7562;&#x696D;&#x5566;&#xFF01;</p>
<p>&#x7136;&#x5F8C;&#x60F3;&#x8981;&#x7279;&#x5225;&#x611F;&#x8B1D; Ray&#xFF0C;&#x5728;&#x6211;&#x4E00;&#x500B;&#x4EBA;&#x505A;&#x5C08;&#x6848;&#x7684;&#x904E;&#x7A0B;&#x4E2D;&#x5E6B;&#x52A9;&#x6211;&#x8A31;&#x591A;&#xFF0C;&#x908F;&#x8F2F;&#x5361;&#x4F4F;&#x6642;&#xFF0C;&#x6559;&#x6211;&#x600E;&#x9EBC;&#x6574;&#x7406;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7DD2;&#xFF0C;&#x9047;&#x5230;&#x7A0B;&#x5F0F;&#x78BC;&#x8DD1;&#x4E0D;&#x51FA;&#x4F86;&#x9084;&#x600E;&#x9EBC;&#x770B;&#x90FD;&#x627E;&#x4E0D;&#x5230;&#x539F;&#x56E0;&#x6642;&#xFF0C;&#x6559;&#x6211;&#x4E00;&#x6B65;&#x6B65; debug&#xFF0C;&#x5206;&#x6790;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x91CD;&#x9EDE;&#x662F;&#x4F60;&#x7E3D;&#x662F;&#x5F88;&#x8010;&#x5FC3;&#x8B1B;&#x5230;&#x6211;&#x771F;&#x7684;&#x807D;&#x61C2;&#xFF08;&#x611F;&#x52D5;&#x843D;&#x6DDA;&#xFF09;&#xFF0C;&#x96D6;&#x7136;&#x6700;&#x5F8C;&#x514D;&#x4E0D;&#x4E86;&#x9084;&#x662F;&#x8981;&#x55C6;&#x6211;&#x4E00;&#x4E0B; XD &#x4F46;&#x6211;&#x5728;&#x554F;&#x4F60;&#x554F;&#x984C;&#x7684;&#x904E;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4E5F;&#x5B78;&#x7FD2;&#x5230;&#x628A;&#x554F;&#x984C;&#x8B1B;&#x5230;&#x4F60;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x4E86;&#x89E3;&#xFF0C;&#x4E5F;&#x5F9E;&#x4F60;&#x6539;&#x5584;&#x6211;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x4E2D;&#x5B78;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x601D;&#x7DAD;&#x548C;&#x5BEB;&#x6CD5;&#xFF0C;&#x6BCF;&#x6B21;&#x554F;&#x554F;&#x984C;&#x90FD;&#x50CF;&#x5728;&#x6316;&#x5BF6;&#x54C8;&#x54C8;&#x54C8;&#x3002;</p>
<p>&#x6700;&#x5F8C;&#xFF0C;&#x82E5;&#x662F;&#x770B;&#x5B8C;&#x6211;&#x7684;&#x5206;&#x4EAB;&#x5C0D;&#x9019;&#x500B;&#x5DE5;&#x7A0B;&#x5E2B;&#x57F9;&#x8A13;&#x71DF;&#x6709;&#x8208;&#x8DA3;&#x7684;&#x4EBA;&#xFF0C;&#x6B61;&#x8FCE;&#x4F60;&#x52A0;&#x5165;&#x706B;&#x7BAD;&#x968A;&#xFF01;&#x4E00;&#x8D77;&#x767C;&#x5C04;&#x706B;&#x7BAD;&#x5427;&#xFF5E;&#xFF5E;&#x1F680;&#x1F680;</p>
<p>&#x795D;&#x798F;&#x5927;&#x5BB6;&#x90FD;&#x80FD;&#x8F49;&#x8077;&#x6210;&#x529F;:D</p>
<h2 id="&#x7B2C;&#x4E8C;&#x68AF;&#x5176;&#x4ED6;&#x5B78;&#x54E1;&#x7684;&#x6587;&#x7AE0;&#x53C3;&#x8003;"><a href="#&#x7B2C;&#x4E8C;&#x68AF;&#x5176;&#x4ED6;&#x5B78;&#x54E1;&#x7684;&#x6587;&#x7AE0;&#x53C3;&#x8003;" class="headerlink" title="&#x7B2C;&#x4E8C;&#x68AF;&#x5176;&#x4ED6;&#x5B78;&#x54E1;&#x7684;&#x6587;&#x7AE0;&#x53C3;&#x8003;"></a>&#x7B2C;&#x4E8C;&#x68AF;&#x5176;&#x4ED6;&#x5B78;&#x54E1;&#x7684;&#x6587;&#x7AE0;&#x53C3;&#x8003;</h2><ul>
<li><a href="https://medium.com/@paris267/%E9%A3%9B%E5%87%BA%E7%81%AB%E7%AE%AD%E9%9A%8A-280b2131554d" target="_blank" rel="noopener">Daniel &#x2014; &#x98DB;&#x51FA;&#x706B;&#x7BAD;&#x968A;</a></li>
<li><a href="https://medium.com/@jedy05097952/%E5%BE%9E%E8%87%AA%E5%AD%B8%E5%88%B0%E7%81%AB%E7%AE%AD%E9%9A%8A-%E7%B6%B2%E9%A0%81%E5%AD%B8%E7%BF%92%E6%AD%B7%E7%A8%8B-e0e9b426ad11" target="_blank" rel="noopener">&#x96C6;&#x9EDE;&#x9001;&#x7D05;&#x5229; / Hiro &#x2014; &#x5F9E;&#x81EA;&#x5B78;&#x5230;&#x706B;&#x7BAD;&#x968A; - &#x7DB2;&#x9801;&#x5FC3;&#x8DEF;&#x6B77;&#x7A0B;</a></li>
</ul>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E5%85%AD%E8%A7%92%E5%AD%B8%E9%99%A2/">#六角學院</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E5%89%8D%E7%AB%AF/">#前端</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E7%81%AB%E7%AE%AD%E9%9A%8A%E5%9F%B9%E8%A8%93%E7%87%9F/">#火箭隊培訓營</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/f2e/20200412/393573562/">Flex 修煉時光屋</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop is-hidden-mobile article-nav-next">
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="notification is-danger">
    You need to set <code>install_url</code> to use ShareThis. Please set it in <code>_config.yml</code>.
</div>

</div>



<div class="comments">
    <h3 class="title is-4">評論</h3>
    
<div id="disqus_thread">
    
    <div class="notification is-danger">
        You forgot to set the <code>shortname</code> for Disqus. Please set it in <code>_config.yml</code>.
    </div>
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript" target="_blank" rel="noopener">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 yinmin8610&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="CC" href="">
                    
                    <i class="fab fa-creative-commons"></i>
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="CC-by" href="">
                    
                    <i class="fab fa-creative-commons-by"></i>
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="CC-nc" href="">
                    
                    <i class="fab fa-creative-commons-nc"></i>
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站內搜尋" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '頁面',
                CATEGORIES: '分類',
                TAGS: '標籤',
                UNTITLED: '(無標題)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>