<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>2020春季網頁切版直播班-八週全記錄 - Yinmin&#39;s blog</title>

<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="今天是切版直播班結業式，獲得老師頒發的最坦助教XD 也恭喜老師突破全台完課率，達到 55 %！">



<meta name="keywords" content="前端,網頁,技術,網頁開發,前端開發,JavaScript,HTML,CSS,SCSS">



    <meta name="description" content="今天是切版直播班結業式，獲得老師頒發的最坦助教XD 也恭喜老師突破全台完課率，達到 55 %！">
<meta property="og:type" content="article">
<meta property="og:title" content="2020春季網頁切版直播班-八週全記錄">
<meta property="og:url" content="http://yinmin8610.github.io/share/20200625/1099903927/index.html">
<meta property="og:site_name" content="Yinmin&#39;s blog">
<meta property="og:description" content="今天是切版直播班結業式，獲得老師頒發的最坦助教XD 也恭喜老師突破全台完課率，達到 55 %！">
<meta property="og:locale" content="zh_TW">
<meta property="og:image" content="https://firebasestorage.googleapis.com/v0/b/images-5a265.appspot.com/o/hexo%2F4-banner.png?alt=media&amp;token=8c59e396-7111-48af-ba7d-d15dd9f1e3e7">
<meta property="article:published_time" content="2020-06-25T07:58:39.000Z">
<meta property="article:modified_time" content="2020-06-25T08:08:19.315Z">
<meta property="article:author" content="yinmin8610">
<meta property="article:tag" content="前端">
<meta property="article:tag" content="六角學院">
<meta property="article:tag" content="直播課程">
<meta name="twitter:card" content="summary">
<meta name="twitter:image" content="https://firebasestorage.googleapis.com/v0/b/images-5a265.appspot.com/o/hexo%2F4-banner.png?alt=media&amp;token=8c59e396-7111-48af-ba7d-d15dd9f1e3e7">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.9.0/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    
<script async src="https://www.googletagmanager.com/gtag/js?id=UA-154219631-1"></script>
<script>
    window.dataLayer = window.dataLayer || [];
    function gtag(){dataLayer.push(arguments);}
    gtag('js', new Date());

    gtag('config', 'UA-154219631-1');
</script>


    


<!-- Global site tag (gtag.js) - Google Analytics -->
<script async src="https://www.googletagmanager.com/gtag/js?id=UA-154219631-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-154219631-1');
</script>

<meta name="generator" content="Hexo 4.2.1"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    Yinmin&#39;s blog
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">文章</a>
            
            <a class="navbar-item "
               href="/categories">分類</a>
            
            <a class="navbar-item "
               href="/tags">標籤</a>
            
            <a class="navbar-item "
               href="/about">關於我</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜尋" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            <div class="navbar-item is-hoverable has-dropdown is-hidden-mobile is-hidden-tablet-only toc">
                <a class="navbar-item" title="目錄">
                    <i class="fa fa-list"></i>
                </a>
                <div class="navbar-dropdown is-right">
                    
                    
                    
                    
                    <a class="navbar-item" href="#前言">1&nbsp;&nbsp;<b>前言</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#改作業的起點">2&nbsp;&nbsp;<b>改作業的起點</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#開始直播">3&nbsp;&nbsp;<b>開始直播</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#遇到困難">4&nbsp;&nbsp;<b>遇到困難</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#成長">5&nbsp;&nbsp;<b>成長</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#八週">6&nbsp;&nbsp;<b>八週</b></a>
                    
                    
                    
                    <a class="navbar-item" href="#第一週">6.1&nbsp;&nbsp;第一週</a>
                    
                    
                    
                    <a class="navbar-item" href="#第二週">6.2&nbsp;&nbsp;第二週</a>
                    
                    
                    
                    <a class="navbar-item" href="#第三週">6.3&nbsp;&nbsp;第三週</a>
                    
                    
                    
                    <a class="navbar-item" href="#第四週">6.4&nbsp;&nbsp;第四週</a>
                    
                    
                    
                    <a class="navbar-item" href="#第五週">6.5&nbsp;&nbsp;第五週</a>
                    
                    
                    
                    <a class="navbar-item" href="#第六週">6.6&nbsp;&nbsp;第六週</a>
                    
                    
                    
                    <a class="navbar-item" href="#第七週">6.7&nbsp;&nbsp;第七週</a>
                    
                    
                    
                    <a class="navbar-item" href="#第八週">6.8&nbsp;&nbsp;第八週</a>
                    
                </div>
            </div>
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/yinmin8610" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            <a class="navbar-item" title="Medium" href="https://medium.com/@alice0050722" target="_blank" rel="noopener">
                
                <i class="fab fa-medium"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            2020春季網頁切版直播班-八週全記錄
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2020-06-25T07:58:39.000Z" itemprop="datePublished">6月 25 2020</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/share/">分享</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            22 分鐘 讀完 (約 3283 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p><img src="https://firebasestorage.googleapis.com/v0/b/images-5a265.appspot.com/o/hexo%2F4-banner.png?alt=media&amp;token=8c59e396-7111-48af-ba7d-d15dd9f1e3e7" alt="2020&#x6625;&#x5B63;&#x7DB2;&#x9801;&#x5207;&#x7248;&#x76F4;&#x64AD;&#x73ED;"></p>
<a id="more"></a>

<h2 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h2><p>&#x4ECA;&#x5929;&#x662F;&#x5207;&#x7248;&#x76F4;&#x64AD;&#x73ED;&#x7D50;&#x696D;&#x5F0F;&#xFF0C;&#x7372;&#x5F97;&#x8001;&#x5E2B;&#x9812;&#x767C;&#x7684;&#x6700;&#x5766;&#x52A9;&#x6559;XD &#x4E5F;&#x606D;&#x559C;&#x8001;&#x5E2B;&#x7A81;&#x7834;&#x5168;&#x53F0;&#x5B8C;&#x8AB2;&#x7387;&#xFF0C;&#x9054;&#x5230; 55 %&#xFF01;</p>
<p>&#x5F8C;&#x4F86;&#x53BB;&#x770B; Excel &#x7D00;&#x9304;&#xFF0C;&#x6211;&#x6539;&#x4E86; 264 &#x4EFD;&#x4F5C;&#x696D;&#xFF01;&#xFF01;&#xFF08;&#x96D6;&#x7136;&#x9084;&#x6709; 20 &#x4EFD;&#x5DE6;&#x53F3;&#x9084;&#x6C92;&#x770B;&#xFF0C;&#x7B49;&#x6211;&#xFF5E;&#xFF09; &#x6539;&#x904E;&#x7684;&#x5B78;&#x751F;&#x540D;&#x5B57;&#x6211;&#x5927;&#x7D04;&#x6709;&#x5370;&#x8C61;&#xFF0C;&#x4E5F;&#x53BB;&#x770B;&#x4E86;&#x4E00;&#x4E9B;&#x4EBA;&#x7684;&#x5FC3;&#x5F97;&#xFF08;&#x6709;&#x770B;&#x7684;&#x6709;&#x62CD;&#x624B;&#xFF09;&#xFF0C;&#x65BC;&#x662F;&#x4E5F;&#x60F3;&#x8A18;&#x9304;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x9019;&#x5169;&#x500B;&#x6708;&#x7684;&#x5FC3;&#x5F97;&#x548C;&#x6210;&#x9577;&#xFF0C;&#x53E6;&#x5916;&#x5728;&#x6587;&#x7AE0;&#x5F8C;&#x6BB5;&#x4E5F;&#x6703;&#x5206;&#x4EAB;&#x6BCF;&#x5468;&#x4F5C;&#x696D;&#x4E2D;&#x91CD;&#x8981;&#x7684;&#x89C0;&#x5FF5;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x85C9;&#x9019;&#x7BC7;&#x6587;&#x7AE0;&#x6AA2;&#x8996;&#x81EA;&#x5DF1;&#x662F;&#x5426;&#x90FD;&#x6709;&#x9054;&#x5230;&#x76EE;&#x6A19;&#x5594;&#xFF5E;</p>
<h2 id="&#x6539;&#x4F5C;&#x696D;&#x7684;&#x8D77;&#x9EDE;"><a href="#&#x6539;&#x4F5C;&#x696D;&#x7684;&#x8D77;&#x9EDE;" class="headerlink" title="&#x6539;&#x4F5C;&#x696D;&#x7684;&#x8D77;&#x9EDE;"></a>&#x6539;&#x4F5C;&#x696D;&#x7684;&#x8D77;&#x9EDE;</h2><p>&#x5728;&#x76F4;&#x64AD;&#x73ED;&#x6B63;&#x5F0F;&#x958B;&#x59CB;&#x524D;&#xFF0C;&#x6211;&#x8CA0;&#x8CAC;&#x7684;&#x662F;&#x524D;&#x6BB5;&#x7684;&#x5C0F;&#x7DF4;&#x7FD2;&#x548C; Flex &#x4F5C;&#x696D;&#xFF0C;&#x90FD;&#x4E0D;&#x7B97;&#x4E00;&#x500B;&#x5B8C;&#x6574;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x9031;&#x958B;&#x59CB;&#x7684;&#x6642;&#x5019;&#x89BA;&#x5F97;&#x81EA;&#x5DF1;&#x6C92;&#x8DDF;&#x8457;&#x505A;&#x904E;&#x4E00;&#x904D;&#x6703;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x600E;&#x9EBC;&#x770B;&#x5E38;&#x898B;&#x7684;&#x554F;&#x984C;&#x548C;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E5F;&#x6BD4;&#x8F03;&#x96E3;&#x4E86;&#x89E3;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x5361;&#x4F4F;&#x7684;&#x9EDE;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x524D;&#x5E7E;&#x9031;&#x9031;&#x672B;&#x6211;&#x90FD;&#x5728;&#x505A;&#x5927;&#x5BB6;&#x7684;&#x4F5C;&#x696D;&#xFF0C;&#x5C31;&#x9019;&#x6A23;&#x5927;&#x6982;&#x8DDF;&#x4E86;&#x56DB;&#x9031;&#x7D42;&#x65BC;&#x7D42;&#x65BC;&#x6162;&#x6162;&#x6293;&#x5230;&#x8A23;&#x7AC5;</p>
<h2 id="&#x958B;&#x59CB;&#x76F4;&#x64AD;"><a href="#&#x958B;&#x59CB;&#x76F4;&#x64AD;" class="headerlink" title="&#x958B;&#x59CB;&#x76F4;&#x64AD;"></a>&#x958B;&#x59CB;&#x76F4;&#x64AD;</h2><p>&#x5230;&#x4E86;&#x7B2C;&#x4E8C;&#x9031;&#x56E0;&#x70BA;&#x8001;&#x5E2B;&#x60F3;&#x63D0;&#x4F9B;&#x7D66;&#x5927;&#x5BB6;&#x66F4;&#x591A;&#x7684;&#x8CC7;&#x6E90;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x88AB;&#x8001;&#x5E2B;&#x534A;&#x8DEF;&#x63A8;&#x5751;&#x76F4;&#x64AD;&#xFF0C;&#x6211;&#x7576;&#x4E0B;&#x53CD;&#x61C9;&#x771F;&#x7684;&#x662F;&#x300C;&#x86E4;&#xFF1F;&#x6211;&#x55CE;&#xFF1F;&#x300D;&#x8001;&#x5E2B;&#x9084;&#x7B11;&#x8457;&#x56DE;&#x7B54;&#x6211;&#x300C;&#x4E0D;&#x7136;&#x662F;&#x8AB0;XD&#x300D;</p>
<p>&#x9A5A;&#x559C;&#x9A5A;&#x5687;&#x53C8;&#x6709;&#x4E00;&#x9EDE;&#x9EDE;&#x7684;&#x671F;&#x5F85;&#xFF0C;&#x56E0;&#x70BA;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x4E0D;&#x662F;&#x5F88;&#x64C5;&#x9577;&#x8B1B;&#x8A71;&#xFF0C;&#x4F46;&#x53C8;&#x53EF;&#x4EE5;&#x5617;&#x8A66;&#x65B0;&#x7684;&#x6311;&#x6230;&#x662F;&#x96E3;&#x5F97;&#x6709;&#x7684;&#x6A5F;&#x6703;&#xFF0C;&#x6211;&#x7684;&#x56DB;&#x6708;&#x771F;&#x7684;&#x5982;&#x540C;&#x81EA;&#x5DF1;&#x5728;&#x4E09;&#x6708;&#x5E95;&#x6642;&#x7684;&#x9858;&#x671B;&#x4E00;&#x6A23;&#xFF0C;&#x4F9D;&#x820A;&#x5145;&#x6EFF;&#x6311;&#x6230;&#x5440;&#x54C8;&#x54C8;&#x54C8;</p>
<p>&#x9084;&#x8A18;&#x5F97;&#x7B2C;&#x4E00;&#x6B21;&#x76F4;&#x64AD;&#x5B8C;&#x6211;&#x99AC;&#x4E0A;&#x79C1;&#x8A0A;&#x6D27;&#x6770;&#x8AAA;&#x6211;&#x8B1B;&#x7684;&#x721B;&#x7206;&#x4E86;&#xFF0C;&#x90A3;&#x5929;&#x76F4;&#x64AD;&#x7DCA;&#x5F35;&#x5230;&#x4E0D;&#x884C;&#xFF0C;&#x5B78;&#x751F;&#x554F;&#x6211;&#x554F;&#x984C;&#x7684;&#x6642;&#x5019;&#x90FD;&#x89BA;&#x5F97;&#x8166;&#x888B;&#x4E00;&#x7247;&#x7A7A;&#x767D;&#xFF0C;&#x6709;&#x6642;&#x5019;&#x662F;&#x77E5;&#x9053;&#x7B54;&#x6848;&#x537B;&#x56E0;&#x70BA;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x9EBC;&#x8868;&#x9054;&#x8B93;&#x6211;&#x5F88;&#x56F0;&#x64FE;&#xFF0C;&#x81E8;&#x6642;&#x53CD;&#x61C9;&#x5F88;&#x5DEE;</p>
<p>&#x8001;&#x5E2B;&#x5348;&#x4F11;&#x6642;&#x7279;&#x5730;&#x8D70;&#x904E;&#x4F86;&#x8DDF;&#x6211;&#x8AAA;&#x6C92;&#x95DC;&#x4FC2;&#x5566;&#xFF0C;&#x4EBA;&#x751F;&#x7E3D;&#x662F;&#x8981;&#x6311;&#x6230;&#x4E00;&#x4E0B;&#x6C92;&#x505A;&#x904E;&#x7684;&#x4E8B;&#x9EBB;&#xFF01;&#x7576;&#x4E0B;&#x6C92;&#x60F3;&#x5F88;&#x591A;&#x53EA;&#x89BA;&#x5F97;&#x5F88;&#x62B1;&#x6B49;&#xFF0C;&#x5403;&#x5348;&#x9910;&#x7684;&#x6642;&#x5019;&#x8166;&#x888B;&#x7A7A;&#x767D;&#x5230;&#x4E0B;&#x5348;&#x3002;&#x5F8C;&#x4F86;&#x60F3;&#x5230;&#x9019;&#x4EF6;&#x4E8B;&#xFF0C;&#x89BA;&#x5F97;&#x8001;&#x5E2B;&#x7684;&#x9F13;&#x52F5;&#x771F;&#x7684;&#x662F;&#x5F88;&#x6B23;&#x6170;&#xFF0C;&#x8B93;&#x6211;&#x5728;&#x4E4B;&#x5F8C;&#x7684;&#x6BCF;&#x9031;&#x66F4;&#x8A8D;&#x771F;&#x6E96;&#x5099;&#x5167;&#x5BB9;&#xFF0C;&#x6211;&#x4E5F;&#x9AD4;&#x8A8D;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x5F31;&#x9EDE;&#x548C;&#x9700;&#x8981;&#x52A0;&#x5F37;&#x7684;&#x89C0;&#x5FF5;&#x3002;&#x7B2C;&#x4E8C;&#x9031;&#x76F4;&#x64AD;&#x5C31;&#x9806;&#x5229;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x6642;&#x9593;&#x638C;&#x63A7;&#x4E5F;&#x6293;&#x5F97;&#x525B;&#x597D;&#xFF0C;&#x4F46;&#x90A3;&#x6B21;&#x61C9;&#x8A72;&#x771F;&#x7684;&#x53EA;&#x662F;&#x525B;&#x597D;&#x800C;&#x5DF2;&#x5566;XD&#x3002;</p>
<h2 id="&#x9047;&#x5230;&#x56F0;&#x96E3;"><a href="#&#x9047;&#x5230;&#x56F0;&#x96E3;" class="headerlink" title="&#x9047;&#x5230;&#x56F0;&#x96E3;"></a>&#x9047;&#x5230;&#x56F0;&#x96E3;</h2><p>&#x7B2C;&#x4E8C;&#x9031;&#x4F5C;&#x696D;&#x5FEB;&#x901F;&#x589E;&#x9577;&#x7684;&#x6642;&#x5019;&#x6211;&#x958B;&#x59CB;&#x6709;&#x6539;&#x4E0D;&#x5B8C;&#x7684;&#x60C5;&#x6CC1;&#xFF0C;&#x751A;&#x81F3;&#x8B93;&#x5B78;&#x751F;&#x7B49;&#x6211;&#x8D85;&#x904E;&#x4E09;&#x56DB;&#x5929;&#xFF0C;&#x6D27;&#x6770;&#x90A3;&#x6642;&#x5019;&#x9023;&#x5047;&#x65E5;&#x90FD;&#x5728;&#x6539;&#x4F5C;&#x696D;&#x9084;&#x5E6B;&#x6211;&#x5206;&#x64D4;&#x4E86;&#x6C92;&#x6539;&#x5B8C;&#x7684;&#x90E8;&#x5206;&#x3002;&#x6211;&#x4E5F;&#x53CD;&#x7701;&#x81EA;&#x5DF1;&#x662F;&#x4E0D;&#x662F;&#x770B;&#x5F97;&#x592A;&#x56B4;&#x683C;&#x7D66;&#x901A;&#x904E;&#x7684;&#x4F5C;&#x696D;&#x5F88;&#x5C11;&#xFF0C;&#x5C0E;&#x81F4;&#x5B78;&#x751F;&#x4FEE;&#x6539;&#x6642;&#x9593;&#x88AB;&#x62C9;&#x5F88;&#x9577;&#xFF0C;&#x6211;&#x4E5F;&#x8981;&#x82B1;&#x5927;&#x91CF;&#x7684;&#x6642;&#x9593;&#x91CD;&#x65B0;&#x770B;&#xFF0C;&#x65BC;&#x662F;&#x8B93;&#x65B0;&#x7684;&#x4F5C;&#x696D;&#x4E00;&#x76F4;&#x88AB;&#x7B49;&#x5F85;&#x6279;&#x6539;&#xFF0C;&#x7576;&#x6642;&#x8001;&#x5E2B;&#x7D66;&#x4E86;&#x6211;&#x4E00;&#x4E9B;&#x6539;&#x5584;&#x7684;&#x5EFA;&#x8B70;&#xFF0C;&#x4E26;&#x544A;&#x8A34;&#x6211;&#x8B93;&#x6BCF;&#x4F4D;&#x5B78;&#x751F;&#x90FD;&#x80FD;&#x7ACB;&#x5373;&#x7372;&#x5F97;&#x56DE;&#x994B;&#x548C;&#x9F13;&#x52F5;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4E5F;&#x56E0;&#x70BA;&#x90A3;&#x6B21;&#x6A5F;&#x6703;&#x6211;&#x91CD;&#x65B0;&#x8ABF;&#x6574;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x9806;&#x5E8F;&#x548C;&#x5FC3;&#x614B;&#xFF0C;&#x5F8C;&#x4F86;&#x5DF2;&#x7D93;&#x88AB;&#x5927;&#x5BB6;&#x7DF4;&#x5230;&#x4E00;&#x5929;&#x53EF;&#x4EE5;&#x770B;&#x5B8C;&#x5341;&#x500B;&#x5DE6;&#x53F3;&#x60F9;</p>
<h2 id="&#x6210;&#x9577;"><a href="#&#x6210;&#x9577;" class="headerlink" title="&#x6210;&#x9577;"></a>&#x6210;&#x9577;</h2><p>&#x5927;&#x7D04;&#x5230;&#x7B2C;&#x516D;&#x9031;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x6211;&#x6709;&#x6DF1;&#x523B;&#x611F;&#x53D7;&#x5230;&#x5927;&#x5BB6;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x90FD;&#x9032;&#x6B65;&#x4E86;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x89BA;&#x5F97;&#x6709;&#x6240;&#x6536;&#x7A6B;&#xFF0C;&#x900F;&#x904E;&#x6539;&#x4F5C;&#x696D;&#x548C;&#x56DE;&#x8986;&#x554F;&#x984C;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x5B78;&#x7FD2;&#x7406;&#x89E3;&#x6BCF;&#x500B;&#x4EBA;&#x7684;&#x601D;&#x8003;&#x908F;&#x8F2F;&#x3001;&#x5B78;&#x7FD2;&#x8046;&#x807D;&#x548C;&#x60F3;&#x89E3;&#x6C7A;&#x8FA6;&#x6CD5;&#x3002;&#x5728;&#x6280;&#x8853;&#x4E0A;&#x7684;&#x6210;&#x9577;&#x662F;&#x5728;&#x7B2C;&#x4E94;&#x9031;&#x56E0;&#x70BA;&#x8981;&#x958B;&#x59CB;&#x4F7F;&#x7528; Gulp &#x548C;&#x64B0;&#x5BEB; SCSS&#xFF0C;&#x6211;&#x5728;&#x9031;&#x672B;&#x5FEB;&#x901F;&#x770B;&#x5B8C;&#x4E86;&#x9019;&#x5169;&#x500B;&#x516D;&#x89D2;&#x8AB2;&#x7A0B;&#xFF0C;&#x6211;&#x624D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x4EE5;&#x524D; SCSS &#x5BEB;&#x5F97;&#x6709;&#x591A;&#x721B;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x76F4;&#x64AD;&#x6559;&#x5B78;&#x771F;&#x7684;&#x6703;&#x4F7F;&#x4EBA;&#x6210;&#x9577;&#xFF0C;&#x56E0;&#x70BA;&#x6709;&#x8CAC;&#x4EFB;&#x5728;&#x6240;&#x4EE5;&#x903C;&#x8FEB;&#x81EA;&#x5DF1;&#x8981;&#x9054;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x7A0B;&#x5EA6;&#x5C31;&#x6703;&#x62FC;&#x547D;&#x5B78;&#x7FD2;&#xFF0C;&#x76F4;&#x64AD;&#x9019;&#x4EF6;&#x4E8B;&#x4E5F;&#x662F;&#xFF0C;&#x5230;&#x5F8C;&#x4F86; Ray &#x90FD;&#x8AAA;&#x6211;&#x958B;&#x59CB;&#x53EF;&#x4EE5;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x8DDF;&#x5927;&#x5BB6;&#x804A;&#x5929;&#x804A; 20&#x5206;&#x9418;&#x4E86;&#xFF08;&#xFF1F;<br>&#x662F;&#x8AAA;&#x5F88;&#x611F;&#x8B1D;&#x4F60;&#x6BCF;&#x500B;&#x79AE;&#x62DC;&#x90FD;&#x5E6B;&#x6211;&#x9304;&#x5F71;&#x526A;&#x7247;&#x3001;&#x958B;&#x5834;&#x534A;&#x5C0F;&#x6642;&#x524D;&#x548C;&#x6211;&#x5C0D;&#x5167;&#x5BB9;&#xFF0C;&#x8B93;&#x6211;&#x5728;&#x76F4;&#x64AD;&#x6642;&#x5C0D;&#x81EA;&#x5DF1;&#x6709;&#x66F4;&#x591A;&#x7684;&#x81EA;&#x4FE1;&#x3002;</p>
<p>&#x56E0;&#x70BA;&#x65E9;&#x4E0A;&#x76F4;&#x64AD;&#x7684;&#x95DC;&#x4FC2;&#x4EBA;&#x6578;&#x4E0D;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x6703;&#x53BB;&#x770B;&#x9304;&#x5F71;&#xFF0C;&#x4F46;&#x8001;&#x5E2B;&#x5F8C;&#x4F86;&#x8DDF;&#x6211;&#x8AAA;&#x883B;&#x591A;&#x4EBA;&#x6709;&#x5728;&#x770B;&#xFF0C;&#x9019;&#x4EF6;&#x4E8B;&#x624D;&#x8B93;&#x6211;&#x958B;&#x59CB;&#x89BA;&#x5F97;&#x5167;&#x5BB9;&#x771F;&#x7684;&#x662F;&#x5C0D;&#x5927;&#x5BB6;&#x6709;&#x5E6B;&#x52A9;&#x7684;&#xFF0C;&#x5728;&#x7B2C;&#x4E03;&#x9031;&#x5DE6;&#x53F3;&#x7684;&#x6642;&#x5019;&#x6211;&#x958B;&#x59CB;&#x6536;&#x5230;&#x4E00;&#x4E9B;&#x5B78;&#x751F;&#x7684;&#x56DE;&#x994B;&#xFF0C;&#x6709;&#x5B78;&#x751F;&#x8DDF;&#x6211;&#x8AAA;&#x5F88;&#x591A;&#x6642;&#x5019;&#x90FD;&#x662F;&#x770B;&#x5B8C;&#x76F4;&#x64AD;&#x624D;&#x77E5;&#x9053;&#x600E;&#x9EBC;&#x958B;&#x59CB;&#x5BEB;&#x4F5C;&#x696D;&#xFF0C;&#x597D;&#x611F;&#x52D5;&#x5594;&#x55DA;&#x55DA;QQ &#x56E0;&#x70BA;&#x6BCF;&#x6B21;&#x76F4;&#x64AD;&#x5B8C;&#x6211;&#x4E5F;&#x4E0D;&#x592A;&#x6E05;&#x695A;&#x5927;&#x5BB6;&#x5438;&#x6536;&#x5F97;&#x5982;&#x4F55;&#xFF0C;&#x6240;&#x4EE5;&#x6536;&#x5230;&#x9019;&#x6A23;&#x7684;&#x611F;&#x8B1D;&#x771F;&#x7684;&#x5F88;&#x958B;&#x5FC3;&#xFF01;</p>
<p>&#x53E6;&#x5916;&#x4E5F;&#x5F9E;&#x8001;&#x5E2B;&#x8EAB;&#x4E0A;&#x5B78;&#x5230;&#x5F88;&#x591A;&#x6559;&#x5B78;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x56E0;&#x70BA;&#x76EE;&#x6A19;&#x662F;&#x63D0;&#x5347;&#x5B8C;&#x8AB2;&#x7387;&#x548C;&#x4F5C;&#x696D;&#x7E73;&#x4EA4;&#x7387;&#xFF0C;&#x4E2D;&#x9593;&#x5C31;&#x4E00;&#x76F4;&#x4E0D;&#x65B7;&#x5730;&#x60F3;&#x51FA;&#x5404;&#x7A2E;&#x80FD;&#x9F13;&#x52F5;&#x5B78;&#x751F;&#x4EA4;&#x4F5C;&#x696D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BCF;&#x6B21;&#x6D27;&#x6770;&#x4F86;&#x627E;&#x6211;&#x8A0E;&#x8AD6;&#x7684;&#x6642;&#x5019;&#x90FD;&#x89BA;&#x5F97;&#x8001;&#x5E2B;&#x771F;&#x7684;&#x662F;&#x70BA;&#x9019;&#x500B;&#x76F4;&#x64AD;&#x73ED;&#x5949;&#x737B;&#x5F88;&#x591A;&#x5FC3;&#x529B;&#xFF0C;&#x771F;&#x7684;&#x5F88;&#x4F69;&#x670D;&#x4ED6;&#x80FD;&#x60F3;&#x51FA;&#x9019;&#x9EBC;&#x591A;&#x62DB;&#xFF0C;&#x5305;&#x542B;&#x6700;&#x521D;&#x898F;&#x5283;&#x7684; Boss &#x8B93;&#x4F60;&#x8EAB;&#x8655;&#x6253;&#x602A;&#x7684;&#x904A;&#x6232;&#x9AD4;&#x9A57;&#x4E2D;&#x3001;&#x5206;&#x7D44;&#x8B93;&#x5718;&#x968A;&#x5408;&#x4F5C;&#x89E3;&#x4EFB;&#x52D9;&#x8B93;&#x5718;&#x54E1;&#x7522;&#x751F;&#x5171;&#x60A3;&#x96E3;&#x611F;&#x60C5;&#x9032;&#x800C;&#x9F13;&#x52F5;&#x5F7C;&#x6B64;&#x5230;&#x5F8C;&#x4F86;&#x4E92;&#x76F8;&#x5B78;&#x7FD2;&#x3001;&#x5718;&#x968A;&#x9593;&#x7684;&#x5C0F;&#x5C0F;&#x7AF6;&#x8CFD;&#x3001;&#x52A9;&#x6559;&#x76F4;&#x64AD;&#x3001;&#x5F8C;&#x52E4;&#x7D44;&#x7BC4;&#x4F8B;&#x7D66;&#x5404;&#x4F4D;&#x6EFF;&#x5230;&#x7206;&#x7684;&#x8CC7;&#x6E90;&#x3001;&#x5F71;&#x7247;&#x89C0;&#x770B;&#x64CD;&#x4F5C;&#x670D;&#x52D9;&#x3001;&#x96D9;&#x500D;&#x7206;&#x64CA;&#x3001;&#x52A0;&#x958B; DLC &#x76F4;&#x64AD;&#xFF08;&#x6211;&#x4E5F;&#x662F;&#x5C31;&#x9019;&#x6A23;&#x518D;&#x6B21;&#x88AB;&#x63A8;&#x4E0B;&#x53BB;&#x7684;&#xFF09;&#x6700;&#x5F8C;&#x751A;&#x81F3;&#x5B8C;&#x6210;&#x524D;&#x56DB;&#x95DC;&#x6709;&#x5C0F;&#x79AE;&#x7269;&#x3001;&#x516D;&#x95DC;&#x80FD;&#x7372;&#x5F97;&#x52A0;&#x78BC;&#x9304;&#x5F71;&#x7B49;&#x7B49;&#x2026;&#xFF0C;&#x5927;&#x5BB6;&#x9084;&#x4E0D;&#x5BEB;&#x7206;&#x4F5C;&#x696D;&#xFF01;</p>
<p>&#x7279;&#x5225;&#x611F;&#x8B1D;&#x82F1;&#x9CF4;&#xFF08;&#x5F8C;&#x52E4;&#x7D44;&#x6210;&#x54E1;&#xFF09;&#x81EA;&#x9858;&#x64D4;&#x4EFB;&#x6211;&#x7684;&#x5C0F;&#x5E6B;&#x624B;&#xFF0C;&#x5728;&#x76F4;&#x64AD;&#x524D;&#x90FD;&#x6703;&#x554F;&#x6211;&#x6709;&#x6C92;&#x6709;&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x9700;&#x8981;&#x5354;&#x52A9;&#xFF0C;&#x6709;&#x5169;&#x4E09;&#x6B21;&#x9084;&#x8DDF;&#x6211;&#x4E00;&#x8D77;&#x71AC;&#x591C;&#x5230;&#x5169;&#x9EDE;&#x591A;&#xFF0C;&#x6709;&#x4E00;&#x6B21;&#x5C31;&#x662F;&#x5F88;&#x96E3;&#x7684;&#x7B2C;&#x4E09;&#x95DC;&#x5566;&#xFF5E;&#xFF5E;more &#x7684;&#x5B57;&#x7279;&#x6548;&#x5C31;&#x662F;&#x4ED6;&#x5E6B;&#x6211;&#x505A;&#x7684;&#xFF01;&#x9084;&#x6709;&#x8449;&#x5B50;&#xFF0C;&#x5E38;&#x5E38;&#x6703;&#x554F;&#x4ED6;&#x4E00;&#x4E9B;&#x7248;&#x578B;&#x554F;&#x984C;&#x4E5F;&#x90FD;&#x5F88;&#x71B1;&#x5FC3;&#x5E6B;&#x6211;&#x770B;&#xFF0C;&#x7B2C;&#x4E09;&#x9031;&#x7684;&#x5716;&#x7247;&#x56E0;&#x70BA;&#x9047;&#x5230; flex &#x5C31;&#x7121;&#x6CD5;&#x6B63;&#x5E38;&#x7E2E;&#x653E;&#xFF0C;&#x4E5F;&#x662F;&#x7576;&#x5929;&#x4E0B;&#x73ED;&#x5F8C;&#x8A0E;&#x8AD6;&#x4E86;&#x5F88;&#x4E45;&#x7684;&#x6771;&#x897F;</p>
<p>&#x63A5;&#x8457;&#x6211;&#x5011;&#x5C31;&#x4F86;&#x56DE;&#x9867;&#x4E00;&#x4E0B;&#x9019;&#x516B;&#x9031;&#x6211;&#x5011;&#x90FD;&#x7D93;&#x6B77;&#x4E86;&#x4EC0;&#x9EBC;&#x54C8;&#x54C8;</p>
<h2 id="&#x516B;&#x9031;"><a href="#&#x516B;&#x9031;" class="headerlink" title="&#x516B;&#x9031;"></a>&#x516B;&#x9031;</h2><h3 id="&#x7B2C;&#x4E00;&#x9031;"><a href="#&#x7B2C;&#x4E00;&#x9031;" class="headerlink" title="&#x7B2C;&#x4E00;&#x9031;"></a>&#x7B2C;&#x4E00;&#x9031;</h3><p>&#x7DF4;&#x7FD2;&#x4E3B;&#x984C;&#xFF1A; margin / padding</p>
<p>&#x7B2C;&#x4E00;&#x9031;&#x7684;&#x6253;&#x5E95;&#x771F;&#x7684;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x96D6;&#x7136;&#x770B;&#x4F3C;&#x7C21;&#x55AE;&#x7684;&#x4E3B;&#x984C;&#xFF0C;&#x4F46;&#x662F;&#x5C0D;&#x4E00;&#x4E9B;&#x65B0;&#x624B;&#x4F86;&#x8AAA;&#x9019;&#x7D55;&#x5C0D;&#x662F;&#x5E38;&#x4F7F;&#x7528;&#x932F;&#x8AA4;&#x7684;&#x524D;&#x4E09;&#x540D;&#x3002;&#x4E5F;&#x56E0;&#x70BA;&#x662F;&#x7B2C;&#x4E00;&#x9031;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x5C0F;&#x7D30;&#x7BC0;&#x8981;&#x8B1B;&#xFF0C;&#x50CF;&#x662F;<strong>&#x6A19;&#x7C64;&#x4F7F;&#x7528;&#x662F;&#x5426;&#x6B63;&#x78BA;&#x4EE5;&#x53CA;&#x7B26;&#x5408;&#x8A9E;&#x610F;&#x5316;</strong>&#x3001;<strong>&#x5B78;&#x6703;&#x770B;&#x8A2D;&#x8A08;&#x7A3F;&#x627E;&#x51FA;&#x898F;&#x7BC4;</strong>&#xFF0C;&#x9019;&#x4E9B;&#x5230;&#x7B2C;&#x516B;&#x9031;&#x4F9D;&#x820A;&#x90FD;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#xFF0C;&#x9019;&#x4E5F;&#x662F;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x76F4;&#x64AD;&#x7684;&#x6642;&#x5019;&#x8DDF;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x7684;&#x5167;&#x5BB9;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x5728;&#x7B2C;&#x4E00;&#x9031;&#x5B78;&#x5230; &#x8A8D;&#x8B58;&#x5B57;&#x9AD4;&#x8A2D;&#x5B9A;&#x548C; img &#x5E95;&#x4E0B;&#x6703;&#x7559;&#x767D;&#x9019;&#x4EF6;&#x4E8B;&#xFF08;&#x5230;&#x73FE;&#x5728;&#x9084;&#x662F;&#x89BA;&#x5F97;&#x5F88;&#x4E0D;&#x53EF;&#x7F6E;&#x4FE1;&#xFF09;</p>
<p>Demo&#xFF1A; <a href="https://yinmin8610.github.io/hexschool-webLayoutTraining/week1/">https://yinmin8610.github.io/hexschool-webLayoutTraining/week1/</a></p>
<p>&#x672C;&#x9031;&#x7684;&#x5B78;&#x7FD2;&#x76EE;&#x6A19;&#xFF1A;</p>
<ul>
<li>&#x4E86;&#x89E3; box-model</li>
<li>margin / padding &#x63A8;&#x64E0;&#x65B9;&#x5411;&#x4E00;&#x81F4;</li>
<li>&#x62BD;&#x53D6;&#x5171;&#x540C; class &#xFF08;container &#x7684;&#x4F7F;&#x7528;&#xFF09;</li>
<li>img &#x8A2D;&#x5B9A; display:block &#x7684;&#x542B;&#x7FA9;</li>
<li>&#x6587;&#x5B57;&#x8207;&#x6587;&#x5B57;&#x884C;&#x9AD8;&#x7684;&#x95DC;&#x4FC2;</li>
</ul>
<h3 id="&#x7B2C;&#x4E8C;&#x9031;"><a href="#&#x7B2C;&#x4E8C;&#x9031;" class="headerlink" title="&#x7B2C;&#x4E8C;&#x9031;"></a>&#x7B2C;&#x4E8C;&#x9031;</h3><p>&#x7DF4;&#x7FD2;&#x4E3B;&#x984C;&#xFF1A; flex</p>
<p>&#x4F5C;&#x696D;&#x4E0D;&#x540C;&#x65BC;&#x7B2C;&#x4E00;&#x9031;&#x5168;&#x90E8;&#x5782;&#x76F4;&#x7684;&#x6392;&#x5217;&#xFF0C;&#x958B;&#x59CB;&#x51FA;&#x73FE;&#x4E26;&#x6392;&#x7684;&#x5448;&#x73FE;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x7DF4;&#x7FD2;&#x6700;&#x57FA;&#x672C;&#x7684; flex &#x8A9E;&#x6CD5;&#x3002;&#x53E6;&#x5916;&#x5C0F;&#x4EFB;&#x52D9;&#x662F;&#x89E3; froggy &#x548C; flex pirate &#xFF0C;&#x53EF;&#x4EE5;&#x5E6B;&#x52A9;&#x5927;&#x5BB6;&#x5728;&#x5F88;&#x77ED;&#x7684;&#x6642;&#x9593;&#x5167;&#x719F;&#x6089; flex&#x3002;</p>
<p>Demo&#xFF1A;<a href="https://yinmin8610.github.io/hexschool-webLayoutTraining/week2/">https://yinmin8610.github.io/hexschool-webLayoutTraining/week2/</a></p>
<p>&#x672C;&#x9031;&#x7684;&#x5B78;&#x7FD2;&#x76EE;&#x6A19;&#xFF1A;</p>
<ul>
<li>margin padding &#x548C; flex &#x7684;&#x642D;&#x914D;</li>
<li>&#x4F7F;&#x7528; flex &#x7684;&#x5782;&#x76F4;&#x6C34;&#x5E73;&#x7F6E;&#x4E2D;&#x8A9E;&#x6CD5;</li>
<li>&#x80CC;&#x666F;&#x5716;&#x8A2D;&#x5B9A;</li>
</ul>
<h3 id="&#x7B2C;&#x4E09;&#x9031;"><a href="#&#x7B2C;&#x4E09;&#x9031;" class="headerlink" title="&#x7B2C;&#x4E09;&#x9031;"></a>&#x7B2C;&#x4E09;&#x9031;</h3><p>&#x7DF4;&#x7FD2;&#x4E3B;&#x984C;&#xFF1A; RWD</p>
<p>&#x9019;&#x9031;&#x7248;&#x578B;&#x56F0;&#x96E3;&#x4EE5;&#x5916;&#x9084;&#x8981;&#x78B0;&#x4E00;&#x9EDE;&#x9EDE; jQuery &#xFF0C;&#x52A0;&#x4E0A;&#x521D;&#x6B21;&#x63A5;&#x89F8; RWD &#x7684;&#x4EBA;&#x61C9;&#x8A72;&#x89BA;&#x5F97;&#x7B2C;&#x4E09;&#x9031;&#x662F;&#x5730;&#x7344;&#x5427;&#xFF01;&#x6211;&#x8A18;&#x5F97;&#x7248;&#x578B;&#x96E3;&#x5230;&#x524D;&#x4E09;&#x5929;&#x90FD;&#x6C92;&#x4EBA;&#x4EA4;&#x4F5C;&#x696D;XD (&#x5F8C;&#x4F86;&#x6709;&#x4EA4;&#x4F5C;&#x696D;&#x7684;&#x771F;&#x7684;&#x8981;&#x5E6B;&#x4F60;&#x5011;&#x62CD;&#x624B;&#xFF09;&#xFF0C;&#x4E5F;&#x56E0;&#x70BA;&#x9019;&#x9031;&#x7684;&#x7A2E;&#x7A2E;&#x8003;&#x9A57;&#xFF0C;&#x8B93;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x6AA2;&#x8996;&#x81EA;&#x5DF1;&#x524D;&#x5169;&#x9031;&#x7684;&#x5E95;&#x5B50;&#x662F;&#x5426;&#x6709;&#x6253;&#x7A69;&#xFF0C;&#x9762;&#x5C0D;&#x8907;&#x96DC;&#x7684;&#x7248;&#x578B;&#x5982;&#x4F55;&#x53BB;&#x62C6;&#x89E3;&#x7B49;&#x7B49;</p>
<p>&#x76F4;&#x64AD;&#x524D;&#x5E7E;&#x5929;&#x6211;&#x4E5F;&#x4E00;&#x76F4;&#x5728;&#x56DE;&#x60F3;&#x81EA;&#x5DF1;&#x7576;&#x521D;&#x5B78;&#x7FD2; RWD &#x5361;&#x4F4F;&#x7684;&#x9EDE;&#x662F;&#x4EC0;&#x9EBC;&#xFF0C;&#x5728;&#x76F4;&#x64AD;&#x524D;&#x7DF4;&#x7FD2;&#x8868;&#x9054;&#x4E86;&#x597D;&#x4E45;&#xFF0C;&#x6015;&#x81EA;&#x5DF1;&#x8B1B;&#x7684;&#x5167;&#x5BB9;&#x5927;&#x5BB6;&#x8D8A;&#x807D;&#x8D8A;&#x4E0D;&#x61C2;&#xFF08;&#x8868;&#x9054;&#x771F;&#x7684;&#x597D;&#x96E3;&#xFF09;</p>
<p>&#x9019;&#x9031;&#x6211;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x5C0F;&#x6536;&#x7A6B;&#xFF0C;&#x50CF;&#x662F; img &#x5728;&#x4F7F;&#x7528; flex &#x4E0B;&#x7121;&#x6CD5;&#x6B63;&#x5E38;&#x7E2E;&#x653E;&#xFF0C;&#x76EE;&#x524D;&#x627E;&#x5230;&#x5169;&#x7A2E;&#x89E3;&#x6C7A;&#x65B9;&#x6CD5;&#xFF0C;&#x7B2C;&#x4E00;&#x500B;&#x662F;&#x5728;&#x5916;&#x5C64;&#x52A0; </p><div> &#x4F86;&#x9650;&#x5236;&#x5716;&#x7247;&#x5340;&#x584A;&#x7BC4;&#x570D;&#xFF0C;&#x7B2C;&#x4E8C;&#x662F;&#x4F7F;&#x7528; CSS object-fit&#xFF0C;&#x53E6;&#x5916;&#x9084;&#x6709; CSS filter &#x7684;&#x4F7F;&#x7528;<p></p>
<p>Demo&#xFF1A;<a href="https://yinmin8610.github.io/hexschool-webLayoutTraining/week3/">https://yinmin8610.github.io/hexschool-webLayoutTraining/week3/</a></p>
<p>&#x672C;&#x9031;&#x7684;&#x5B78;&#x7FD2;&#x76EE;&#x6A19;&#xFF1A;</p>
<ul>
<li>container &#x7684;&#x4F7F;&#x7528;&#xFF08;&#x8A2D;&#x5B9A; max-width&#xFF09;</li>
<li>RWD &#x7684;&#x57FA;&#x790E;&#x89C0;&#x5FF5;&#xFF08;&#x55AE;&#x4F4D; % &#x53D6;&#x4EE3; px&#xFF09;</li>
<li>media query &#x7684;&#x4F7F;&#x7528; (max-width &amp; min-width &#x5DEE;&#x5225;)</li>
<li>&#x65B7;&#x9EDE;&#x8207;&#x88DD;&#x7F6E;&#x5C3A;&#x5BF8;&#x7684;&#x95DC;&#x4FC2;</li>
</ul>
<h3 id="&#x7B2C;&#x56DB;&#x9031;"><a href="#&#x7B2C;&#x56DB;&#x9031;" class="headerlink" title="&#x7B2C;&#x56DB;&#x9031;"></a>&#x7B2C;&#x56DB;&#x9031;</h3><p>&#x7DF4;&#x7FD2;&#x4E3B;&#x984C;&#xFF1A;&#x591A;&#x9801;&#x5F0F; RWD</p>
<p>&#x5EF6;&#x7E8C;&#x7B2C;&#x4E09;&#x9031;&#x7248;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x591A;&#x52A0;&#x4E86;&#x4E09;&#x56DB;&#x9801;&#x5167;&#x9801;&#xFF0C;&#x9019;&#x9031;&#x53C8;&#x8FCE;&#x4F86;&#x65B0;&#x6311;&#x6230;&#xFF1A;&#x4F7F;&#x7528; Gulp &#x7DE8;&#x8B6F; ejs &#x548C; SCSS&#xFF0C;&#x5B78;&#x751F;&#x8868;&#x793A;&#xFF1A;&#x300C;&#x6BCF;&#x9031;&#x90FD;&#x5728;&#x5237;&#x65B0;&#x4E09;&#x89C0;&#x300D;</p>
<p>&#x6211;&#x5728;&#x9019;&#x4E4B;&#x524D;&#x5B8C;&#x5168;&#x6C92;&#x7528;&#x904E; Gulp &#xFF08;&#x53EA;&#x6709;&#x63A5;&#x89F8;&#x904E;&#x4E00;&#x9EDE; Webpack&#xFF09;&#x8D81;&#x9019;&#x500B;&#x6A5F;&#x6703;&#x4F86;&#x589E;&#x52A0;&#x6280;&#x80FD;&#xFF0C;&#x53E6;&#x5916;&#x4E5F;&#x8907;&#x7FD2;&#x4E86; SCSS &#x91CD;&#x65B0;&#x4E86;&#x89E3;&#x8A2D;&#x8A08;&#x6A21;&#x5F0F; SMACSS / OOCSS / BEM &#x548C;&#x547D;&#x540D;&#x898F;&#x7BC4;&#xFF0C;&#x5728;&#x5B78;&#x7FD2;&#x524D;&#x7AEF;&#x4E00;&#x6BB5;&#x6642;&#x9593;&#x5F8C;&#x91CD;&#x65B0;&#x8907;&#x7FD2; SCSS &#x771F;&#x7684;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x66F4;&#x6DF1;&#x4E00;&#x5C64;&#x7684;&#x9AD4;&#x609F;</p>
<p>&#x672C;&#x9031;&#x7684;&#x5B78;&#x7FD2;&#x76EE;&#x6A19;&#xFF1A;</p>
<ul>
<li>Gulp &#x61C9;&#x7528;</li>
<li>&#x62C6;&#x5206; layout &#x89C0;&#x5FF5;</li>
<li>SCSS &#x6CE8;&#x610F;&#x968E;&#x5C64;&#x904E;&#x591A;&#x554F;&#x984C;&#x3001;&#x8B8A;&#x6578;&#x547D;&#x540D;&#x3001;&#x6A94;&#x6848;&#x62C6;&#x5206;&#x53EF;&#x53C3;&#x8003; 7-1 pattern</li>
</ul>
<h3 id="&#x7B2C;&#x4E94;&#x9031;"><a href="#&#x7B2C;&#x4E94;&#x9031;" class="headerlink" title="&#x7B2C;&#x4E94;&#x9031;"></a>&#x7B2C;&#x4E94;&#x9031;</h3><p>&#x7DF4;&#x7FD2;&#x4E3B;&#x984C;&#xFF1A; Bootstrap </p>
<p>&#x9019;&#x9031;&#x8981;&#x505A;&#x51FA;&#x516D;&#x89D2;&#x7684;&#x5F8C;&#x53F0;&#x4ECB;&#x9762;&#xFF0C;&#x4E3B;&#x8981;&#x4F7F;&#x7528; Bootstrap &#x642D;&#x914D; SCSS&#xFF0C;&#x4ECB;&#x9762;&#x7C21;&#x55AE;&#x8B93;&#x521D;&#x6B21;&#x63A5;&#x89F8; Bootstrap &#x7684;&#x4EBA;&#x53EF;&#x4EE5;&#x5728;&#x9019;&#x9031;&#x5148;&#x5FEB;&#x901F;&#x4E86;&#x89E3;&#x5143;&#x4EF6;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;</p>
<p>&#x672C;&#x9031;&#x7684;&#x5B78;&#x7FD2;&#x76EE;&#x6A19;&#xFF1A;</p>
<ul>
<li>&#x719F;&#x6089; Bootstrap &#x5143;&#x4EF6;&#x4F7F;&#x7528;</li>
<li>&#x6A21;&#x7D44;&#x5316;&#x7684;&#x6982;&#x5FF5;</li>
<li>SCSS &#x7DF4;&#x7FD2;</li>
<li>&#x8868;&#x55AE;&#x5167;&#x4E0D;&#x540C;&#x7684;&#x72C0;&#x614B;</li>
</ul>
<h3 id="&#x7B2C;&#x516D;&#x9031;"><a href="#&#x7B2C;&#x516D;&#x9031;" class="headerlink" title="&#x7B2C;&#x516D;&#x9031;"></a>&#x7B2C;&#x516D;&#x9031;</h3><p>&#x7DF4;&#x7FD2;&#x4E3B;&#x984C;&#xFF1A; &#x591A;&#x9801;&#x5F0F; Bootstrap</p>
<p>&#x9019;&#x9031;&#x7248;&#x578B;&#x7B97;&#x883B;&#x6709;&#x6311;&#x6230;&#x6027;&#x7684;&#xFF0C;&#x7D50;&#x5408; Bootstrap &#x6700;&#x5927;&#x7684;&#x7279;&#x9EDE;&#x97FF;&#x61C9;&#x5F0F;&#x7248;&#x578B;&#x3002;&#x4FCA;&#x5100;&#x7684;&#x8A2D;&#x8A08;&#x7A3F;&#x771F;&#x7684;&#x5F88;&#x591A;&#x7D30;&#x7BC0;&#xFF0C;&#x5E38;&#x5E38;&#x770B;&#x5230;&#x4E2D;&#x9593;&#x5C31;&#x6703;&#x60F3;&#x8AAA;&#x9019;&#x908A;&#x600E;&#x9EBC;&#x7A81;&#x7136;&#x8B8A;&#x9019;&#x6A23;&#x4E86;XD &#x6211;&#x81EA;&#x5DF1;&#x89BA;&#x5F97;&#x9700;&#x8981;&#x5C0D; Bootstrap &#x6709;&#x4E00;&#x5B9A;&#x7684;&#x719F;&#x6089;&#x5EA6;&#x624D;&#x80FD;&#x5FEB;&#x901F;&#x4FEE;&#x6539;&#x6210;&#x81EA;&#x5DF1;&#x8981;&#x7684;&#x6A23;&#x5F0F;&#xFF0C;&#x5728;&#x770B; Bootstrap &#x6587;&#x4EF6;&#x6642;&#x4E5F;&#x53EF;&#x4EE5;&#x5B78;&#x7FD2;&#x5230;&#x4ED6;&#x7684;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#x548C;&#x7D50;&#x69CB;&#xFF0C;&#x63A1;&#x7528; OOCSS &#x7684;&#x8A2D;&#x8A08;&#x898F;&#x7BC4;&#xFF0C;&#x5BB9;&#x5668;&#x8207;&#x6A23;&#x5F0F;&#x5206;&#x96E2;&#x7684;&#x6700;&#x4F73;&#x5178;&#x7BC4;&#xFF0C;&#x6211;&#x4E5F;&#x5BEB;&#x4E86;&#x4E00;&#x7BC7;<a href="https://yinmin8610.github.io/css/20200603/1243066710/">&#x4ECB;&#x7D39; OOCSS &#x7684;&#x6587;&#x7AE0;</a></p>
<p>Demo&#xFF1A;<a href="https://yinmin8610.github.io/hexschool-week6/">https://yinmin8610.github.io/hexschool-week6/</a></p>
<p>&#x672C;&#x9031;&#x7684;&#x5B78;&#x7FD2;&#x76EE;&#x6A19;&#xFF1A;</p>
<ul>
<li>&#x719F;&#x6089; Bootstrap &#x7DB2;&#x683C;&#x7CFB;&#x7D71;&#x3001;&#x5143;&#x4EF6;&#x7D44;&#x6210;&#x3001;&#x901A;&#x7528;&#x985E;&#x5225; (utilities)</li>
<li>Bootstrap &#x65B7;&#x9EDE;&#x4F7F;&#x7528;&#xFF08;&#x5F9E;&#x624B;&#x6A5F;&#x958B;&#x59CB;&#x7684;&#x958B;&#x767C;&#x65B9;&#x5F0F;&#xFF09;</li>
</ul>
<h3 id="&#x7B2C;&#x4E03;&#x9031;"><a href="#&#x7B2C;&#x4E03;&#x9031;" class="headerlink" title="&#x7B2C;&#x4E03;&#x9031;"></a>&#x7B2C;&#x4E03;&#x9031;</h3><p>&#x7DF4;&#x7FD2;&#x4E3B;&#x984C;&#xFF1A; &#x7DB2;&#x9801;&#x7279;&#x6548;</p>
<p>Ray &#x5148;&#x524D;&#x6709;&#x7528;&#x904E; JS &#x548C; jQuery &#x5404;&#x5BEB;&#x51FA;&#x4E00;&#x500B;&#x7248;&#x672C;&#xFF08;&#x5B8C;&#x5168;&#x6C92;&#x7528;&#x5230;&#x5957;&#x4EF6;&#x8D85;&#x5F37;&#xFF5E;&#xFF5E;&#xFF09;&#x6211;&#x4E5F;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x9019;&#x9031;&#x80FD;&#x4E0D;&#x8981;&#x9760;&#x5957;&#x4EF6;&#x5B8C;&#x6210;&#xFF0C;&#x4F46;&#x9084;&#x6C92;&#x5B8C;&#x6210;&#x5207;&#x7248;&#x54C8;&#x54C8;&#xFF0C;&#x4E4B;&#x5F8C;&#x518D;&#x9644;&#x4E0A;&#x9023;&#x7D50;</p>
<p>&#x672C;&#x9031;&#x7684;&#x5B78;&#x7FD2;&#x76EE;&#x6A19;&#xFF1A;</p>
<ul>
<li>&#x4F7F;&#x7528;&#x5916;&#x90E8;&#x5957;&#x4EF6; AOS</li>
</ul>
<h3 id="&#x7B2C;&#x516B;&#x9031;"><a href="#&#x7B2C;&#x516B;&#x9031;" class="headerlink" title="&#x7B2C;&#x516B;&#x9031;"></a>&#x7B2C;&#x516B;&#x9031;</h3><p>&#x7DF4;&#x7FD2;&#x4E3B;&#x984C;&#xFF1A; &#x5927;&#x578B;&#x8A02;&#x623F;&#x7DB2;</p>
<p>&#x9019;&#x9031;&#x8A2D;&#x8A08;&#x7A3F;&#x6709;&#x8D85;&#x904E; 20 &#x9801;&#xFF0C;&#x5305;&#x542B;&#x5E73;&#x677F;&#x53CA;&#x624B;&#x6A5F;&#x7248;&#x578B;&#xFF0C;&#x9084;&#x6709;&#x975E;&#x5E38;&#x591A;&#x7279;&#x6B8A;&#x6392;&#x7248;&#x7684;&#x61C9;&#x7528;&#xFF0C;&#x5F88;&#x503C;&#x5F97;&#x5927;&#x5BB6;&#x7DF4;&#x7FD2;</p>
<p>&#x672C;&#x9031;&#x7684;&#x5B78;&#x7FD2;&#x76EE;&#x6A19;&#xFF1A;</p>
<ul>
<li>&#x5143;&#x4EF6;&#x6A21;&#x7D44;&#x5316;</li>
<li>&#x5229;&#x7528; variables.scss &#x4FEE;&#x6539;&#x81EA;&#x5DF1;&#x8981;&#x7684;&#x5143;&#x4EF6;&#x6A23;&#x5F0F;</li>
<li>&#x592A;&#x591A;&#x60F9;&#xFF0C;&#x7D50;&#x5408;&#x4EE5;&#x4E0A;</li>
</ul>
<p>&#x7D93;&#x6B77;&#x4E86;&#x516B;&#x9031;&#x837C;&#x6BD2;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x518D;&#x56DE;&#x53BB;&#x770B;&#x81EA;&#x5DF1;&#x7B2C;&#x4E00;&#x9031;&#x7684; code&#xFF0C;&#x770B;&#x8457;&#x81EA;&#x5DF1;&#x5BEB;&#x7684;&#x6771;&#x897F;&#x5982;&#x679C;&#x6703;&#x61F7;&#x7591;&#x9019;&#x771F;&#x7684;&#x662F;&#x6211;&#x5BEB;&#x7684;&#x55CE;&#xFF1F;&#x7684;&#x5FC3;&#x8072; &#xFF0C;&#x90A3;&#x606D;&#x559C;&#x4F60; 6600 &#x82B1;&#x5F97;&#x975E;&#x5E38;&#x503C;&#x5F97;&#xFF0C;&#x9032;&#x6B65;&#x8D85;&#x591A;&#xFF5E;&#xFF5E; &#x4E5F;&#x606D;&#x559C;&#x5B8C;&#x6210;&#x516B;&#x9031;&#x7684;&#x6311;&#x6230;&#x4E00;&#x8D77;&#x7D93;&#x6B77;&#x9019;&#x9EBC;&#x591A;&#x82E6;&#x96E3;&#x54C8;&#x54C8;&#xFF0C;&#x96D6;&#x7136;&#x8981;&#x8AAA;&#x63B0;&#x63B0;&#x4E86;&#x6709;&#x9EDE;&#x6368;&#x4E0D;&#x5F97;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x958B;&#x5FC3;&#x80FD;&#x8A8D;&#x8B58;&#x4F60;&#x5011;&#xFF01;</p>
</div></body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E5%89%8D%E7%AB%AF/">#前端</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E5%85%AD%E8%A7%92%E5%AD%B8%E9%99%A2/">#六角學院</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E7%9B%B4%E6%92%AD%E8%AA%B2%E7%A8%8B/">#直播課程</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop is-hidden-mobile article-nav-prev">
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/css/20200603/1319604089/">Bootstrap 設計模式 - OOCSS</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="addthis_inline_share_toolbox"></div>
<script type="text/javascript" src="//s7.addthis.com/js/300/addthis_widget.js#pubid=ra-5ece3c804b2a1890"></script>

</div>



<div class="comments">
    <h3 class="title is-4">評論</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'http://yinmin8610.github.io/share/20200625/1099903927/';
        this.page.identifier = 'share/20200625/1099903927/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'yimmin8610' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript" target="_blank" rel="noopener">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 yinmin8610&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="CC" href="">
                    
                    <i class="fab fa-creative-commons"></i>
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="CC-by" href="">
                    
                    <i class="fab fa-creative-commons-by"></i>
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="CC-nc" href="">
                    
                    <i class="fab fa-creative-commons-nc"></i>
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-HK");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站內搜尋" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '頁面',
                CATEGORIES: '分類',
                TAGS: '標籤',
                UNTITLED: '(無標題)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>